class ex4(object):
   @classmethod
   #Дана строка-предложение на русском языке. Преобразовать строку так, чтобы
#каждое слово начиналось с заглавной буквы. Словом считать набор символов, не
#содержащий пробелов и ограниченный пробелами или началом/концом строки. Слова, не
#начинающиеся с буквы, не изменять.
   def get_ex_method(self):
                 s=input((print("Введите текст")))
                 print(s.title())

